test/data/out/inv-eqv-sur.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroLR.xsd" xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroInformacion.xsd">
  <soapenv:Body>
    <sum:RegFactuSistemaFacturacion>
      <sum:Cabecera>
        <sum1:ObligadoEmision>
          <sum1:NombreRazon>Invopop S.L.</sum1:NombreRazon>
          <sum1:NIF>B85905495</sum1:NIF>
        </sum1:ObligadoEmision>
      </sum:Cabecera>
      <sum:RegistroFactura>
        <sum1:RegistroAlta>
          <sum1:IDVersion>1.0</sum1:IDVersion>
          <sum1:IDFactura>
            <sum1:IDEmisorFactura>B85905495</sum1:IDEmisorFactura>
            <sum1:NumSerieFactura>SAMPLE-432</sum1:NumSerieFactura>
            <sum1:FechaExpedicionFactura>11-11-2024</sum1:FechaExpedicionFactura>
          </sum1:IDFactura>
          <sum1:NombreRazonEmisor>Invopop S.L.</sum1:NombreRazonEmisor>
          <sum1:TipoFactura>F1</sum1:TipoFactura>
          <sum1:DescripcionOperacion>This is a sample invoice with a standard tax and an equivalence surcharge</sum1:DescripcionOperacion>
          <sum1:Destinatarios>
            <sum1:IDDestinatario>
              <sum1:NombreRazon>Sample Consumer</sum1:NombreRazon>
              <sum1:NIF>B63272603</sum1:NIF>
            </sum1:IDDestinatario>
          </sum1:Destinatarios>
          <sum1:Desglose>
            <sum1:DetalleDesglose>
              <sum1:Impuesto>01</sum1:Impuesto>
              <sum1:ClaveRegimen>01</sum1:ClaveRegimen>
              <sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
              <sum1:TipoImpositivo>21.0</sum1:TipoImpositivo>
              <sum1:BaseImponibleOimporteNoSujeto>1800.00</sum1:BaseImponibleOimporteNoSujeto>
              <sum1:CuotaRepercutida>378.00</sum1:CuotaRepercutida>
              <sum1:TipoRecargoEquivalencia>5.2</sum1:TipoRecargoEquivalencia>
              <sum1:CuotaRecargoEquivalencia>93.60</sum1:CuotaRecargoEquivalencia>
            </sum1:DetalleDesglose>
          </sum1:Desglose>
          <sum1:CuotaTotal>378.00</sum1:CuotaTotal>
          <sum1:ImporteTotal>2178.00</sum1:ImporteTotal>
          <sum1:Encadenamiento>
            <sum1:RegistroAnterior>
              <sum1:IDEmisorFactura>B12345678</sum1:IDEmisorFactura>
              <sum1:NumSerieFactura>SAMPLE-001</sum1:NumSerieFactura>
              <sum1:FechaExpedicionFactura>26-11-2024</sum1:FechaExpedicionFactura>
              <sum1:Huella>0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF</sum1:Huella>
            </sum1:RegistroAnterior>
          </sum1:Encadenamiento>
          <sum1:SistemaInformatico>
            <sum1:NombreRazon>My Software</sum1:NombreRazon>
            <sum1:NIF>12345678A</sum1:NIF>
            <sum1:NombreSistemaInformatico>My Software</sum1:NombreSistemaInformatico>
            <sum1:IdSistemaInformatico>A1</sum1:IdSistemaInformatico>
            <sum1:Version>1.0</sum1:Version>
            <sum1:NumeroInstalacion>12345678A</sum1:NumeroInstalacion>
            <sum1:TipoUsoPosibleSoloVerifactu>S</sum1:TipoUsoPosibleSoloVerifactu>
            <sum1:TipoUsoPosibleMultiOT>S</sum1:TipoUsoPosibleMultiOT>
            <sum1:IndicadorMultiplesOT>N</sum1:IndicadorMultiplesOT>
          </sum1:SistemaInformatico>
          <sum1:FechaHoraHusoGenRegistro>2024-11-26T05:00:00+01:00</sum1:FechaHoraHusoGenRegistro>
          <sum1:TipoHuella>01</sum1:TipoHuella>
          <sum1:Huella>1D8655D3243F182BFD85FE21518AFA1B16F6BEA0ED0B09E12A2A0E5211B7C898</sum1:Huella>
        </sum1:RegistroAlta>
      </sum:RegistroFactura>
    </sum:RegFactuSistemaFacturacion>
  </soapenv:Body>
</soapenv:Envelope>